## Terraform Plan

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gar.google_artifact_registry_repository.repo will be created
  + resource "google_artifact_registry_repository" "repo" {
      + create_time      = (known after apply)
      + description      = "Docker repository for container images"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "hyperbola-476507"
      + repository_id    = "docker-repo"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # module.github_actions_wi.google_iam_workload_identity_pool.pool will be created
  + resource "google_iam_workload_identity_pool" "pool" {
      + description               = "Workload Identity Pool for GitHub Actions"
      + display_name              = "GitHub Actions Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "hyperbola-476507"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-actions-pool"
    }

  # module.github_actions_wi.google_iam_workload_identity_pool_provider.provider will be created
  + resource "google_iam_workload_identity_pool_provider" "provider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider for GitHub Actions"
      + display_name                       = "GitHub Actions Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "hyperbola-476507"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-actions-pool"
      + workload_identity_pool_provider_id = "github-actions-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.github_actions_wi.google_project_iam_member.project_roles["roles/container.developer"] will be created
  + resource "google_project_iam_member" "project_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "hyperbola-476507"
      + role    = "roles/container.developer"
    }

  # module.github_actions_wi.google_project_iam_member.project_roles["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "project_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "hyperbola-476507"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.github_actions_wi.google_project_iam_member.project_roles["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "project_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "hyperbola-476507"
      + role    = "roles/storage.admin"
    }

  # module.github_actions_wi.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "github-actions-sa"
      + disabled     = false
      + display_name = "GitHub Actions Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "hyperbola-476507"
      + unique_id    = (known after apply)
    }

  # module.github_actions_wi.google_service_account_iam_member.sa_binding will be created
  + resource "google_service_account_iam_member" "sa_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.gke_standard[0].google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = true
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "primary-cluster"
      + network                                  = (known after apply)
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "hyperbola-476507"
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + gcp_filestore_csi_driver_config {
              + enabled = true
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = false
            }
        }

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + cluster_autoscaling {
          + auto_provisioning_locations = (known after apply)
          + autoscaling_profile         = "BALANCED"
          + enabled                     = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]

          + managed_prometheus {
              + enabled = true
            }
        }

      + network_policy {
          + enabled = true
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config {
          + mode               = "BASIC"
          + vulnerability_mode = "VULNERABILITY_BASIC"
        }

      + vertical_pod_autoscaling {
          + enabled = true
        }

      + workload_identity_config {
          + workload_pool = "hyperbola-476507.svc.id.goog"
        }
    }

  # module.gke_standard[0].google_container_node_pool.on_demand will be created
  + resource "google_container_node_pool" "on_demand" {
      + cluster                     = "primary-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "primary-cluster-on-demand"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "hyperbola-476507"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 5
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = "pd-ssd"
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cost-center"   = "critical"
              + "workload-type" = "on-demand"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "n2-standard-2"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + taint {
              + effect = "NO_SCHEDULE"
              + key    = "workload-type"
              + value  = "on-demand"
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

  # module.gke_standard[0].google_container_node_pool.spot will be created
  + resource "google_container_node_pool" "spot" {
      + cluster                     = "primary-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "primary-cluster-spot"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "hyperbola-476507"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 20
          + min_node_count  = 2
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = "pd-standard"
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cost-center"   = "general"
              + "workload-type" = "spot"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = true

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.node_cpu will be created
  + resource "google_monitoring_alert_policy" "node_cpu" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "High Node CPU Usage"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "hyperbola-476507"

      + conditions {
          + display_name = "Node CPU > 80%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"k8s_node\" AND metric.type=\"kubernetes.io/node/cpu/allocatable_utilization\""
              + threshold_value = 0.8

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_MEAN"
                }
            }
        }
    }

  # module.monitoring.google_monitoring_alert_policy.pod_restart will be created
  + resource "google_monitoring_alert_policy" "pod_restart" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "High Pod Restart Rate"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "hyperbola-476507"

      + conditions {
          + display_name = "Pod restart rate > 5 in 5 minutes"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"k8s_pod\" AND metric.type=\"kubernetes.io/container/restart_count\""
              + threshold_value = 5

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_RATE"
                }
            }
        }
    }

  # module.monitoring.google_monitoring_alert_policy.spot_preemption will be created
  + resource "google_monitoring_alert_policy" "spot_preemption" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Spot Instance Preemption"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "hyperbola-476507"

      + conditions {
          + display_name = "Spot node preempted"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "60s"
              + filter          = "resource.type=\"k8s_node\" AND metric.type=\"kubernetes.io/node/preemptible\""
              + threshold_value = 0

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_RATE"
                }
            }
        }
    }

  # module.monitoring.google_monitoring_notification_channel.email will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Email Notification"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "alerts@example.com"
        }
      + name                = (known after apply)
      + project             = "hyperbola-476507"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.network.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "gke-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "hyperbola-476507"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "gke-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "hyperbola-476507"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.1.0.0/16"
              + range_name    = "pods"
            },
          + {
              + ip_cidr_range = "10.2.0.0/16"
              + range_name    = "services"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.workload_identity.google_project_iam_member.workload_identity_roles["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "workload_identity_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "hyperbola-476507"
      + role    = "roles/storage.objectViewer"
    }

  # module.workload_identity.google_service_account.workload_identity will be created
  + resource "google_service_account" "workload_identity" {
      + account_id   = "app-workload-identity"
      + disabled     = false
      + display_name = "Workload Identity SA for default"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "hyperbola-476507"
      + unique_id    = (known after apply)
    }

  # module.workload_identity.google_service_account_iam_member.workload_identity_binding will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:hyperbola-476507.svc.id.goog[default/app-sa]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint = (sensitive value)
  + cluster_name     = "primary-cluster"
  + network_name     = "gke-network"
  + project_id       = "hyperbola-476507"
  + region           = "us-central1"
  + repository_id    = "docker-repo"
  + repository_url   = "us-central1-docker.pkg.dev/hyperbola-476507/docker-repo"

```